In [162]:
##lets study pandas

Introduction to Pandas

What is pandas?

Pandas is a python library used for data manipulation and analysis.
It has functions for analyzing, cleaning, exploring, and manipulating data.

It provides two primary data structures:

Series: One-dimensional labeled array.
DataFrame: Two-dimensional labeled data structure.

In [ ]:
#pip install pandas  if u have not installed pandas

In [1]:
# Import pandas in your notebook
import pandas as pd

In [5]:
# Lets begin with series 
# A series is a one-dimensional array that can hold any data type
# The data is aligned in a row and has an index
# You can create a series using the pd.Series() function
# The function takes in a list as an argument
series=pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
# You can also create a series using a tuple
series2=pd.Series((1,2,3,4,5))
print(series2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
# You can also create a series using a dictionary
series3=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
print(series3)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
(series[0])

1

In [14]:
series2[2]

3

In [17]:
print(series3[4])
print(series3['a'])

5
1

In [18]:
print(series+10)

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [26]:
#Creating a dat frame
# A data frame is a two-dimensional array that can hold any data type
# The data is aligned in rows and columns
# You can create a data frame using the pd.DataFrame() function
# The function takes in a dictionary as an argument
# The keys of the dictionary are the column names
# The values of the dictionary are the column values

In [22]:
data={
    'name':['Ninad','Aditya','Smeet','Ayush','Jay','Rishit','Shrey','Shreyash','Ash','Prsni','Jash','Vanshika','Ishu','Kamal','Kruttika'],
    'Roll_No':['J041','J042','J043','J044','J051','J063','J065','J046','J017','J073','J058','J047','J016','J015','J001']   
}
df=pd.DataFrame(data)

In [23]:
df

        name Roll_No
0      Ninad    J041
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
14  Kruttika    J001

In [25]:
df.columns
df.dtypes

name       object
Roll_No    object
dtype: object

In [28]:
# Accessing Columns
df['name']

0        Ninad
1       Aditya
2        Smeet
3        Ayush
4          Jay
5       Rishit
6        Shrey
7     Shreyash
8          Ash
9        Prsni
10        Jash
11    Vanshika
12        Ishu
13       Kamal
14    Kruttika
Name: name, dtype: object

In [29]:
df['Roll_No']

0     J041
1     J042
2     J043
3     J044
4     J051
5     J063
6     J065
7     J046
8     J017
9     J073
10    J058
11    J047
12    J016
13    J015
14    J001
Name: Roll_No, dtype: object

In [31]:
#This will give an error df['name','Roll_No'] 
#You can access multiple columns by passing a list of column names
df[['name','Roll_No']]

        name Roll_No
0      Ninad    J041
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
14  Kruttika    J001

In [39]:
# Accessing Rows
# You can access rows using the loc[] attribute
a=df.loc[0]
b=df.loc[0:1]
c=df.iloc[0:14]
d=df.iloc[1:14]

In [40]:
print(a)
print(b)
print(c)
print(d)

name       Ninad
Roll_No     J041
Name: 0, dtype: object
     name Roll_No
0   Ninad    J041
1  Aditya    J042
        name Roll_No
0      Ninad    J041
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
        name Roll_No
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015

In [41]:
a=df.iloc[0]
b=df.iloc[0:1]
c=df.iloc[0:14]
d=df.iloc[1:14]

In [42]:
print(a)
print(b)
print(c)
print(d)

name       Ninad
Roll_No     J041
Name: 0, dtype: object
    name Roll_No
0  Ninad    J041
        name Roll_No
0      Ninad    J041
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
        name Roll_No
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015

In [43]:
#difference between loc and iloc
#loc is label-based, which means that you have to specify rows and columns based on their row and column labels
#iloc is integer index based, so you have to specify rows and columns by their
#integer index like you did in the previous exercise

In [44]:
#now accessing specific rows and columns

df.loc[0,'name']

'Ninad'

In [45]:
df.loc[0:15,'name']

0        Ninad
1       Aditya
2        Smeet
3        Ayush
4          Jay
5       Rishit
6        Shrey
7     Shreyash
8          Ash
9        Prsni
10        Jash
11    Vanshika
12        Ishu
13       Kamal
14    Kruttika
Name: name, dtype: object

In [46]:
df.loc[0:15,['name','Roll_No']]

        name Roll_No
0      Ninad    J041
1     Aditya    J042
2      Smeet    J043
3      Ayush    J044
4        Jay    J051
5     Rishit    J063
6      Shrey    J065
7   Shreyash    J046
8        Ash    J017
9      Prsni    J073
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
14  Kruttika    J001

In [57]:
#x = df[df['Roll_No'] == 'J041','J047']
#x = df.loc[df['Roll_No'] == 'J041', 'J047']
subset_df = df.loc[df['Roll_No'].isin(['J041', 'J047'])]

In [59]:
subset_df

        name Roll_No
0      Ninad    J041
11  Vanshika    J047

In [61]:
#Read various file formats


# Read a CSV file
#df=pd.read_csv('data.csv')

# Read a excel file
#df=pd.read_excel('data.xlsx')

# Read a JSON file
#df=pd.read_json('data.json')

In [62]:
# Read a SQL file
#import sqlite3
#conn = sqlite3.connect('database.db')
#df = pd.read_sql_query('SELECT * FROM table_name', conn)

In [63]:
# To save a data frame to a file, you can use the to_csv() function
df.to_csv('data.csv',index=False)

In [64]:
df.to_json('outpu_json.json')

In [65]:
## Data Exploration and inspection

In [66]:
# To get the first 5 rows of a data frame, you can use the head() function
df.head()

     name Roll_No
0   Ninad    J041
1  Aditya    J042
2   Smeet    J043
3   Ayush    J044
4     Jay    J051

In [67]:
df.tail()

        name Roll_No
10      Jash    J058
11  Vanshika    J047
12      Ishu    J016
13     Kamal    J015
14  Kruttika    J001

In [69]:
# Get the shape of the data frame
df.shape

(15, 2)

In [75]:
#
df.columns

Index(['name', 'Roll_No'], dtype='object')

In [76]:
# df.index will give you the index of the data frame
df.index

RangeIndex(start=0, stop=15, step=1)

In [70]:
# df.describe() is used to view some basic statistical details like percentile, mean, std etc. of a data frame or a series of numeric values.
df.describe()

         name Roll_No
count      15      15
unique     15      15
top     Ninad    J041
freq        1       1

In [78]:
# df.info() will give you a concise summary of the data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     15 non-null     object
 1   Roll_No  15 non-null     object
dtypes: object(2)
memory usage: 372.0+ bytes

In [79]:
# To get the unique values in a column, you can use the unique() function
df['name'].value_counts()

name
Ninad       1
Aditya      1
Smeet       1
Ayush       1
Jay         1
Rishit      1
Shrey       1
Shreyash    1
Ash         1
Prsni       1
Jash        1
Vanshika    1
Ishu        1
Kamal       1
Kruttika    1
Name: count, dtype: int64

In [80]:
## we will learn data cleaning in depth in next course 
# Handling missing values overview

# To check for missing values in a data frame, you can use the isna() function
df.isna().sum()

name       0
Roll_No    0
dtype: int64

In [ ]:
# To drop missing values, you can use the dropna() function
df= df.dropna()

In [82]:
#Data Transformation
#changing column names
df=df.rename(columns={'name':'Name','Roll_No':'Roll_No.'})

In [84]:
df.head()

     Name Roll_No.
0   Ninad     J041
1  Aditya     J042
2   Smeet     J043
3   Ayush     J044
4     Jay     J051

In [85]:
df['Age']=[20,21,21,21,20,20,22,21,21,21,21,21,19,20,21]

In [86]:
df.head()

     Name Roll_No.  Age
0   Ninad     J041   20
1  Aditya     J042   21
2   Smeet     J043   21
3   Ayush     J044   21
4     Jay     J051   20

In [87]:
df.dtypes

Name        object
Roll_No.    object
Age          int64
dtype: object

In [89]:
# To change the data type of a column, you can use the astype() function
df['Age']=df['Age'].astype('float')

In [90]:
df.dtypes

Name         object
Roll_No.     object
Age         float64
dtype: object

In [93]:
df.loc[0:5, 'Name':'Age']

     Name Roll_No.   Age
0   Ninad     J041  20.0
1  Aditya     J042  21.0
2   Smeet     J043  21.0
3   Ayush     J044  21.0
4     Jay     J051  20.0
5  Rishit     J063  20.0

In [95]:
df.iloc[0:5, 0:3]

     Name Roll_No.   Age
0   Ninad     J041  20.0
1  Aditya     J042  21.0
2   Smeet     J043  21.0
3   Ayush     J044  21.0
4     Jay     J051  20.0

In [96]:
#Filtering Data
df=df[df['Age']>20]

In [97]:
df

        Name Roll_No.   Age
1     Aditya     J042  21.0
2      Smeet     J043  21.0
3      Ayush     J044  21.0
6      Shrey     J065  22.0
7   Shreyash     J046  21.0
8        Ash     J017  21.0
9      Prsni     J073  21.0
10      Jash     J058  21.0
11  Vanshika     J047  21.0
14  Kruttika     J001  21.0

In [120]:
df['Unwanted Column'] = [0, 0, 0, 0, 0, 0, 0, 0, 0]

In [126]:
df

        Name Roll_No.   Age  Unwanted Column
1     Aditya     J042  21.0                0
2      Smeet     J043  21.0                0
6      Shrey     J065  22.0                0
7   Shreyash     J046  21.0                0
8        Ash     J017  21.0                0
9      Prsni     J073  21.0                0
10      Jash     J058  21.0                0
11  Vanshika     J047  21.0                0
14  Kruttika     J001  21.0                0

In [128]:
df=df.drop(index=[6])
#droping row which is in 6th index

In [129]:
df=df.drop(columns=['Unwanted Column'])

In [130]:
df

        Name Roll_No.   Age
1     Aditya     J042  21.0
2      Smeet     J043  21.0
7   Shreyash     J046  21.0
8        Ash     J017  21.0
9      Prsni     J073  21.0
10      Jash     J058  21.0
11  Vanshika     J047  21.0
14  Kruttika     J001  21.0

In [131]:
# inplace = True will make the changes in the data frame itself

In [132]:
df

        Name Roll_No.   Age
1     Aditya     J042  21.0
2      Smeet     J043  21.0
7   Shreyash     J046  21.0
8        Ash     J017  21.0
9      Prsni     J073  21.0
10      Jash     J058  21.0
11  Vanshika     J047  21.0
14  Kruttika     J001  21.0

In [137]:
filtered_df = df[df['Age'] == 21]

In [138]:
filtered_df

        Name Roll_No.   Age
1     Aditya     J042  21.0
2      Smeet     J043  21.0
7   Shreyash     J046  21.0
8        Ash     J017  21.0
9      Prsni     J073  21.0
10      Jash     J058  21.0
11  Vanshika     J047  21.0
14  Kruttika     J001  21.0

In [146]:
# I want to add new row in the data frame
# I will use the append() function

new_row={'Name':'Rahul', 'Roll_No.':'J074','Age':21}

In [148]:
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

In [149]:
df

       Name Roll_No.   Age
0    Aditya     J042  21.0
1     Smeet     J043  21.0
2  Shreyash     J046  21.0
3       Ash     J017  21.0
4     Prsni     J073  21.0
5      Jash     J058  21.0
6  Vanshika     J047  21.0
7  Kruttika     J001  21.0
8     Rahul     J074  21.0

In [150]:
Data={
    'Name': ['Rode','Kallind','Ajju'],
    'Roll_No.': ['J075','J076','J077'],
    'Age': [21,21,20]
}

df2=pd.DataFrame(Data)

In [151]:
df2

      Name Roll_No.  Age
0     Rode     J075   21
1  Kallind     J076   21
2     Ajju     J077   20

In [156]:
#concatenating two data frames
merged_df1=pd.concat([df,df2],ignore_index=True)

In [157]:
merged_df1

        Name Roll_No.   Age
0     Aditya     J042  21.0
1      Smeet     J043  21.0
2   Shreyash     J046  21.0
3        Ash     J017  21.0
4      Prsni     J073  21.0
5       Jash     J058  21.0
6   Vanshika     J047  21.0
7   Kruttika     J001  21.0
8      Rahul     J074  21.0
9       Rode     J075  21.0
10   Kallind     J076  21.0
11      Ajju     J077  20.0